<?php

return [

    //=========== ترجمة صفحة التحكم الرئيسية ============//
    'dashboard'                     => 'لوحة التحكم',
    'centerpay'                     => 'سنتر باي',
    'centerpay_show'                => 'واجهة العرض',
    'menu'                          => 'القائمة',

    ##############################################################

    // ================  إدارة القوائم ===================//
    'manage_menus'                  => 'إدارة القوائم ',

    // --------------- القائمة الرئيسية -----------------//
    'show_web_menus'                => ' القائمة الرئيسية',
    'add_new_link'                  => 'إضافة رابط جديد',
    'edit_existing_link'            => 'تعديل بيانات الرابط',
    'category_menu'                 => 'تصنيفات القائمة الرئيسية',

    // ----------------- قائمة المساعدة -------------- //
    'show_web_helps_menu'           => 'قائمة المساعدة',
    'add_new_help_link'             => 'إضافة رابط مساعدة جديد',
    'edit_existing_help_link'       => 'تعديل رابط مساعدة جديد',
    'category_help_menu'            => 'تصنيفات قائمة المساعدة',

    // ............... المشترك في القوائم ................. //
    'title'                         => 'العنوان',
    'link'                          => 'الرابط',

    ##############################################################

    // =============  إدارة عارضات الشرائح  ===============//
    'manage_sliders'                => 'إدارة عارض الشرائح ',

    // --------------- عارض الشرائح الرئيسي --------------//
    'show_main_slider'              => 'عارض الشرائح الرئيسي',
    'add_new_slider'                => 'إضافة شريحة جديدة',
    'edit_existing_slider'          => 'تعديل بيانات الشريحة ',

    // ---------------- عارض الاعلانات ------------------ //
    'show_adv_slider'               => 'عارض الاعلانات',
    'add_new_adv_slider'            => 'إضافة إعلان جديد',
    'edit_existing_adv_slider'      => 'تعديل بيانات الإعلان',

    // ........... المشترك في عارضات الشرائح ....... //
    'show_slider_info'              =>  'عرض تفاصيل الشريحة',
    'url_link'                      => 'رابط الانتقال',
    'url_target'                    => 'مكان العرض',
    'in_the_same_tab'               => 'عرض في نفس الصفحة',
    'in_new_tab'                    => 'عرض في تبويب جديد',


    ##############################################################

    // =============  Manage Categories (product and card categories) ===============//
    'manage_categories'                => 'إدارة التصنيفات',

    // --------------- Product Categories --------------//
    'show_product_categories'              => 'تصنيف المنتجات',
    'add_new_product_category'                => 'إضافة تصنيف منتج ',
    'edit_existing_product_category'          => 'التعديل علي تصنيف منتج',

    // ------------- Card Categories  ------------- //
    'show_card_categories'               => 'تصنيف البطائق',
    'add_new_card_category'            => 'إضافة تصنيف بطاقة',
    'edit_existing_card_category'      => 'التعديل على تصنيف بطاقة',

    // ........... commons in Categories ....... //

    'category_name'                     => 'إسم الصنف',
    'category_card-count'               => 'عدد الباقات',


    ##############################################################

    // =============  Manage Products (product and card ) ===============//
    'manage_products'                => 'إدارة المنتجات',

    // --------------- Product  --------------//
    'show_products'              => 'المتجات',
    'add_new_product'                => 'إضافة منتج جديد',
    'edit_existing_product'          => 'تعديل بيانات المنتج ',

    // ------------- Card   ------------- //
    'show_cards'               => 'الباقات',
    'add_new_card'            => 'إضافة باقة جديدة',
    'edit_existing_card'      => 'تعديل بيانات الباقة',

    // ........... commons in products and cards  ....... //
    'product_name'                  => 'إسم المنتج',
    'card_name'                     => 'إسم الباقة',
    'sku'                           =>  'رمز (Sku)',
    'offer_price'                   =>  'سعر التخفيض',
    'offer_ends'                    =>  'اخر موعد للتخفيض',
    'max_order'                     =>  'اعلي كمية يمكن طلبها',
    'qty_not_limited'               =>  'الكمية غير محدودة',


    ##############################################################

    // =============  Manage Tags  ===============//
    'manage_tags'                => 'إدارة الكلمات المفتاحية',

    // --------------- Tags  --------------//
    'show_tags'              => 'الكلمات المفتاحية',
    'add_new_tag'                => 'إضافة كلمة مفتاحية جديدة',
    'edit_existing_tag'          => 'تعديل بيانات الكلمة المفتاحية',


    // ........... commons in Tag   ....... //
    'tag_name'                  => 'الكلمة المفتاحية',
    'tag_type'                  =>  'نوع التاج',
    'product_tag'               =>  'تاج منتج',
    'card_tag'                  =>  'تاج بطاقة',
    'blog_tag'                  =>  'تاج مدونة',


    ##############################################################

    // =============  Manage Coupon  ===============//
    'manage_coupons'                => 'إدارة كوبونات الخصم',

    // --------------- Coupon  --------------//
    'show_coupons'              => 'كوبونات الخصم',
    'add_new_coupon'                => 'إضافة كوبون خصم جديد',
    'edit_existing_coupon'          => 'تعديل كوبون الخصم',


    // ........... commons in Coupon   ....... //
    'coupon_code'                   =>  'إسم كوبون الخصم',
    'coupon_type'                   =>  'نوع الكوبون',
    'static_value'                  =>  'قيمة ثابته',
    'percentage_value'              =>  'نسبة مئوية',
    'coupon_value'                  =>  'قيمة الكوبون',
    'price_greater_than'            =>  ' يطبع على تسعيرة اكبر من',
    'coupon_start_date'             =>  'تاريخ البدء',
    'coupon_expire_date'            =>  'تاريخ انتهاء الكوبون',
    'expiration_date'               =>  'تاريخ الصلاحية',
    'use_time'                     =>  'عدد مرات الاستخدام',
    'coupon_description'            =>  'وصف الكوبون',

    ##############################################################

    // =============  Manage Users  ===============//
    'manage_users'                => 'إدارة المستخدمين',

    // --------------- Customers  --------------//
    'show_customers'               => 'العملاء',
    'add_new_customer'             => 'إضافة حساب عميل جديد',
    'edit_existing_customer'       => 'تعديل بيانات حساب العميل ',

    // --------------- Supervisors  --------------//
    'show_supervisors'              => 'المشرفين',
    'add_new_supervisor'           => 'إضافة حساب مشرف جديد',
    'edit_existing_supervisor'     => 'تعديل بيانات حساب مشرف ',

    // ........... commons in Users   ....... //
    'customer_name'               => 'إسم العميل ',
    'advertisor_name'               =>  'إسم المشرف',
    'permissions'                   =>  'الصلاحيات',
    'grant_all_permissions'         =>  'منح كل الصلاحيات',




    ##############################################################

    // ========== ترجمه شائعة في اغلب الاقسام  ==========//

    // ---------------- اللغات -----------------------//
    'en'                            => 'الانجليزية',
    'ar'                            => 'العربية',
    'ca'                            => 'الاسبانية',

    // ================= في كل الصفحات ===================//
    'main'                          =>  'الرئيسية',
    'add_new_content'               =>  'إضافة محتوي جديد',
    'yes'                           =>  'نعم',
    'no'                            =>  'لا',
    'description'                   =>  'المحتوي',
    'image'                         =>  'الصورة',
    'images'                        =>  'الصور',
    'featured'                      =>  'المفضلة',
    'qty'                           =>  'الكمية',
    'price'                         =>  'السعر',
    'views'                         =>  'مشاهدات',
    'email'                         =>  'الايميل',
    'mobile'                        =>  'الموبايل',
    'first_name'                    =>  'الإسم الاول',
    'last_name'                     =>  'اللقب',
    'user_name'                     =>  'اسم المستخدم',
    'user_password'                 =>  'كلمة المرور',








    //=========== العرض والإضافة والبحث =================//
    // --------------- التبويبات -------------------//
    'content_tab'                   => ' بيانات المحتوي ',
    'published_tab'                 => 'بيانات النشر',
    'url_tab'                       =>  'الروابط',
    'price_tab'                     => 'التسعيرة',



    // ------------ الحقول المشتركة ---------------//
    'main_category'                 => 'تصنيف رئيسي',
    'published_date'                => 'تاريخ النشر',
    'published_time'                => 'وقت النشر',
    'status'                        => 'الحالة',
    'status_active'                 => 'مفعل',
    'status_inactive'               => 'غير مفعل',
    'actions'                       => 'الإعدادات',

    // ------------ الازرار المشتركة ---------------//
    'save_data'                     => 'حفظ البيانات',
    'update_data'                   => 'حفظ التغييرات',

    // ------------ مكان البحث ---------------//
    'keyword'               => 'ادخل كلمة البحث',
    'search'                => 'بحث',
    'show_all'              => 'عرض الكل',
    'asc'                   => 'تصاعدي',
    'desc'                  => 'تنازلي',
    'created_at'            => 'تاريخ الانشاء',
    'published_on'          => 'زمن النشر',
    'author'                => 'الكاتب',
    'id'                    =>  'الرقم',

    // ================== رسائل الاستجابة ===============//
    'created_successfully'      => 'تم الإضافة بنجاح',
    'updated_successfully'      => 'تم التعديل بنجاح',
    'deleted_successfully'      => 'تم الحذف بنجاح',
    'something_was_wrong'       => 'حدث خطأ ما',
    'confirm_delete_message'    => 'هل انت متاكد من انك تريد حذف هذا السجل !!',
    'no_found_item'             => 'لم يتم العثور على اي عنصر ',
    'user_image_size'           => 'حجم الصورة 500px * 500px لافضل اداء',



    // ================ Validations ======================//
    //---------------- Common Validation -----------------//
    'in'                        => 'باللغة',
    'and'                           =>  'و',


];
