<?php

return [

    //=========== ترجمة صفحة التحكم الرئيسية ============//
    'dashboard'                     => 'لوحة التحكم',
    'centerpay'                     => 'سنتر باي',
    'centerpay_show'                => 'واجهة العرض',
    'menu'                          => 'القائمة',

    // ================  إدارة القوائم ===================//
    'manage_menus'                  => 'إدارة القوائم ',

    // --------------- القائمة الرئيسية -----------------//
    'show_web_menus'                => ' القائمة الرئيسية',
    'add_new_link'                  => 'إضافة رابط جديد',
    'edit_existing_link'            => 'تعديل بيانات الرابط',
    'category_menu'                 => 'تصنيفات القائمة الرئيسية',


    // ----------------- قائمة المساعدة -------------- //
    'show_web_helps_menu'           => 'قائمة المساعدة',
    'add_new_help_link'             => 'إضافة رابط مساعدة جديد',
    'edit_existing_help_link'       => 'تعديل رابط مساعدة جديد',
    'category_help_menu'            => 'تصنيفات قائمة المساعدة',

    // ........... المشترك في القوائم ........... //
    'title'                         => 'العنوان',
    'link'                          => 'الرابط',


    // ========== ترجمه شائعة في اغلب الاقسام  ==========//

    // ---------------- اللغات -----------------------//
    'en'                            => 'الانجليزية',
    'ar'                            => 'العربية',
    'ca'                            => 'الاسبانية',

    // ================= في كل الصفحات ===================//
    'main'                          =>  'الرئيسية',
    'add_new_content'               => 'إضافة محتوي جديد',

    //=========== العرض والإضافة والبحث =================//
    // --------------- التبويبات -------------------//
    'content_tab'                   => ' بيانات المحتوي ',
    'published_tab'                 => 'بيانات النشر',

    // ------------ الحقول المشتركة ---------------//
    'main_category'                 => 'تصنيف رئيسي',
    'published_date'                => 'تاريخ النشر',
    'published_time'                => 'وقت النشر',
    'status'                        => 'الحالة',
    'status_active'                 => 'مفعل',
    'status_inactive'               => 'غير مفعل',
    'actions'                       => 'الإعدادات',

    // ------------ الازرار المشتركة ---------------//
    'save_data'                     => 'حفظ البيانات',
    'update_data'                   => 'حفظ التغييرات',

    // ------------ مكان البحث ---------------//
    'keyword'               => 'ادخل كلمة البحث',
    'search'                => 'بحث',
    'show_all'              => 'عرض الكل',
    'asc'                   => 'تصاعدي',
    'desc'                  => 'تنازلي',
    'created_at'            => 'تاريخ الانشاء',
    'published_on'          => 'زمن النشر',
    'author'                => 'الكاتب',
    'id'                    =>  'الرقم',

    // ================== رسائل الاستجابة ===============//
    'created_successfully'      => 'تم الإضافة بنجاح',
    'updated_successfully'      => 'تم التعديل بنجاح',
    'deleted_successfully'      => 'تم الحذف بنجاح',
    'something_was_wrong'       => 'حدث خطأ ما',
    'confirm_delete_message'    => 'هل انت متاكد من انك تريد حذف هذا السجل !!',
    'no_found_item'             => 'لم يتم العثور على اي عنصر ',


    // ================ Validations ======================//
    //---------------- Common Validation -----------------//
    'in'                        => 'باللغة',

];
